inner_dict = {"звичайній_ключ1": "Hello World", "звичайній_ключ2": 1.2, "звичайній_ключ3": [1, 2, 3], "звичайній_ключ4": True, "звичайній_ключ5": None}
main_dict = {"ключ1": "Hello World", "ключ2": 12, "ключ3": inner_dict, "ключ4": [10, 20, 30]}
type_dict = {"ключ1": type(main_dict["ключ1"]), "ключ2": type(main_dict["ключ2"]), "ключ3": type(main_dict["ключ3"]), "ключ4": type(main_dict["ключ4"])}
inner_type_dict = {"звичайній_ключ1": type(inner_dict["звичайній_ключ1"]), "звичайній_ключ2": type(inner_dict["звичайній_ключ2"]), "звичайній_ключ3": type(inner_dict["звичайній_ключ3"]), "звичайній_ключ4": type(inner_dict["звичайній_ключ4"]), "звичайній_ключ5": type(inner_dict["звичайній_ключ5"])}
print("Словник з типами даних:", type_dict)
print("Звичайній словник:", main_dict)
print("Словник з типами даних звичайного словника:", inner_type_dict)